examples/phtMetalExtractionFoam/validation/BAC-Salgansky/U0=9cmps/constant/SS
thermoType
{
    type            heSolidThermo;
    mixture         pureMixture;
    transport       tabulated;//constIso;//
    thermo          hTabulated;
    equationOfState rhoConst;
    specie          specie;
    energy          sensibleEnthalpy;
}

// Synthetic sapphire

mw 101.96e-3;

mixture
{
    specie
    {
        molWeight       #eval "$mw*1e3";
    }
    thermodynamics
    {
        Hf              0;
        Sf              0;
        Cp
        (
            (250       #eval "67.4/$mw")
            (400       #eval "96.19/$mw")
            (600       #eval "112.85/$mw")
        	(1000      #eval "124.53/$mw")
        	(1500      #eval "132.42/$mw")
        	(3000      #eval "132.42/$mw")
        //    (200   761)
        //	(3000   761)
        );
    }
    transport
    {
		kappa// 23.1;
        (
            (200       30)
            (400       30)
            (700       13)
            (1100      7)
            (1500      5)
            (2000      7)
            (3000      7)
        //      (200    23.1)
        //      (400    23.1)
        );
    }
	
	   equationOfState
    {
        rho     3980;
    }
}
